app/Controllers/ProductController.php

SELECT *
FROM `products`
---
    public function index() {
        $model = new ProductModel();
        $data['products'] = $model->findAll();